{
  "intro": "Starting in early 2016, the Ultimate Frisbee Pickup, (organized by Brendan Beltz at the time) had grown large enough that there was a demand for something more organized. The idea for KUL was born!",
  "paragraphs": [
    "The very first game of KUL was played in May 2016. The first league had 48 players on 5 teams led by Noah Slater, Jordan Ellis, Jumi Bello, Forrest Waters, and Tatami Lee and was played at Aozhidi park with blank t-shirts for jerseys. Scrambling to keep up with the growth of the league, Ed Lu and Dinah Su were able to procure fields in the following season that would handle all the new players. Furthermore, the upgrade from blank t-shirts to sublimated jerseys was brought about by Joann Hsieh and Matus Peciar in Fall 2016. As the players in the league skills improved, the league started to get more competitive which gave KUL an uncertain future as the amount of signups started decreasing for the first time. So in Spring 2018, 6 brand new, first-time captains were chosen. Led by Denise Roman, Abigail Margaret, Christine Wang, Donna Cheng, Natasha Hale, and Georgia Hinton the league became much more recreational and inclusive and the league has grown every season since.",
    "Also in Spring 2018, the KUL Player card was born as a way for the league to be a bigger part of the Kaohsiung community. After a local business mentioned that they couldn't identify players because no one wore their stinky jerseys after the games (thankfully), the idea of a membership card took off and Toby Howes was able to work out deals with over 10 bars and restaurants around Kaohsiung! With all the new changes, KUL has attracted more and more new players to try the sport, but that has led to the new challenge quickly bringing new players up to speed and ready for action. Led by Christopher Perrie and Jitesh Pattni, the league has taken on the overdue task of incorporating the Spirit of the Game to quickly resolve any conflicts and create an environment that everyone feels comfortable in asking questions and understanding what good-sportsmanship entails.",
    "While all the changes had been an improvement on how things were run in the league, the management was in desperate need of some reinforcements. In Fall 2019, Brittney Morris became the first ever director for KUL and her organizational influence was quick to un-stress the captains and players during game day and manage the increasingly difficult tasks of keeping games on time and managing the post-game cleanups."
  ],
  "conclusion": "Since its first game in Summer 2016, the KUL has not only doubled in size, but has had over 250 different players from all over the world. Many of those players have had a huge influence on KUL over the last 4 years and it will be exciting to see what the future has in store!"
}
